{
  "backend/main.mo": "Main Motoko canister defining authorization, approval flows, and data types for courses, resources, exams, certifications, shows, designs, achievements, and user progress.",
  "feature_evidence.json": "Feature evidence report mapping PayPal‑related frontend changes to affected files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries describing functionality of numerous frontend files across components, pages, hooks, and UI sections.",
  "frontend/index.css": "Tailwind base styles defining OKLCH color variables for light and dark themes with global background and text styling.",
  "frontend/index.html": "Basic HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Sets up routing, theming, authentication-driven layout switching between landing, dashboard, and admin panel.",
  "frontend/src/components/admin/AdminCoursesTab.tsx": "Admin interface for listing, creating, editing, and deleting courses with module management. Integrates CRUD hooks and dialog-based forms.",
  "frontend/src/components/admin/AdminDeploymentTab.tsx": "Admin panel section showing deployment environment info, canister ID, network status, and clipboard copy actions. Displays frontend and backend deployment details.",
  "frontend/src/components/admin/AdminSettingsTab.tsx": "Renders admin settings UI with alerts, general configuration cards, and platform information rows.",
  "frontend/src/components/admin/AdminUsersTab.tsx": "Displays user approval stats and a table for managing user approval status with actionable badges.",
  "frontend/src/components/admin/DeveloperGuideTab.tsx": "Provides developer setup instructions using cards and accordion steps with code blocks.",
  "frontend/src/components/dashboard/CommunityTab.tsx": "Shows community discussions, supports creating new posts, and displays discussion detail modals.",
  "frontend/src/components/dashboard/CourseDetailModal.tsx": "Modal for viewing a course, tracking progress, and completing modules with dynamic progress updates.",
  "frontend/src/components/dashboard/CoursesTab.tsx": "Lists available, enrolled, and purchasable courses, handling premium access and course detail modals.",
  "frontend/src/components/dashboard/CreateDesignModal.tsx": "Modal form for creating a design with title, materials, and steps, using mutation to submit and close on success.",
  "frontend/src/components/dashboard/DesignStudioTab.tsx": "Dashboard tab listing user's designs with create, delete, and material guide options, rendering modals and design cards.",
  "frontend/src/components/dashboard/FashionShowsTab.tsx": "Tab that fetches and displays fashion shows with status, collections, and a view button, handling loading and empty states.",
  "frontend/src/components/dashboard/FashionZeroToProModal.tsx": "Modal showing a course's levels, modules, and locked content based on user tier, with scrollable detailed sections.",
  "frontend/src/components/dashboard/MaterialGuideModal.tsx": "Modal presenting an AI material guide with images, tips, and a list of affordable, sustainable materials.",
  "frontend/src/components/dashboard/MentorshipTab.tsx": "Tab describing the mentorship program with mentor/mentee options, images, and explanatory cards.",
  "frontend/src/components/dashboard/ProgressTab.tsx": "Renders a progress dashboard showing points, certifications, and achievements using data from custom query hooks.",
  "frontend/src/components/FeaturedCourseSection.tsx": "Displays a featured course card for Fashion From Zero to Pro with badges, artwork, and navigation to the course detail page.",
  "frontend/src/components/Footer.tsx": "Renders the site footer with branding, navigation links, social icons, and a copyright note. Uses Tailwind styling and static assets.",
  "frontend/src/components/Header.tsx": "Header with logo, navigation, theme toggle, and Internet Identity login/logout handling. Supports admin badge display and route navigation.",
  "frontend/src/components/PricingSection.tsx": "Displays pricing tiers with images and plan details for free and premium options. Uses cards and badges to present features and pricing.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal for initial user profile setup, capturing name, interests, and selected tier, then saving via API. Includes form controls, validation, and option toggles.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor instance based on Internet Identity state and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides context and hooks for managing Internet Identity authentication, including login, logout, and identity loading.",
  "frontend/src/hooks/useQueries.ts": "Defines numerous React Query hooks for interacting with backend APIs such as user profiles, admin tools, courses, and achievements.",
  "frontend/src/index.css": "Configures Tailwind CSS base styles, theme variables, utilities, and custom aesthetic classes.",
  "frontend/src/main.tsx": "Bootstraps the React application, wrapping it with QueryClient and InternetIdentity providers.",
  "frontend/src/pages/AdminPanel.tsx": "Implements the admin interface with tabs for managing courses, users, deployment, developer tools, and settings.",
  "frontend/src/pages/CourseDetailPage.tsx": "Displays course details, handles authentication checks, and manages Stripe/PayPal purchase flows with session tracking.",
  "frontend/src/pages/CourseStorefront.tsx": "Fetches and displays all courses with filtering and highlights a featured course for navigation.",
  "frontend/src/pages/Dashboard.tsx": "Renders the user dashboard with tier-based UI, hero content, and tabbed navigation for various user features.",
  "frontend/src/pages/LandingPage.tsx": "Shows the marketing homepage with hero content, featured course, features list, and navigation to pricing and courses.",
  "frontend/src/pages/PaymentFailure.tsx": "Clears pending purchase session data and displays a payment-cancelled message with navigation options.",
  "frontend/src/pages/PaymentSuccess.tsx": "Validates Stripe or PayPal payment sessions, confirms purchases with the backend, clears session data, and shows success or error states.",
  "frontend/src/utils/urlParams.ts": "Provides helpers for reading URL parameters, persisting them in sessionStorage, and clearing them from URL hash for routing and state handling.",
  "frontend/tailwind.config.js": "Configures Tailwind CSS theme, colors, animations, and plugins including typography, container queries, and animation utilities.",
  "project_state.json": "Tracks project metadata, implemented features, and pending requirements for payment integration work."
}